In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-2.63567347, -1.34565032,  0.87042376],
       [-0.06820421, -0.9368201 ,  1.38536422],
       [-0.22179672,  1.37346946,  0.01575728],
       [ 1.35180912,  0.37630653, -1.72368948]])

In [4]:
dataFrame= pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0 -2.635673 -1.345650  0.870424
1 -0.068204 -0.936820  1.385364
2 -0.221797  1.373469  0.015757
3  1.351809  0.376307 -1.723689

In [6]:
dataFrame[0]

0   -2.635673
1   -0.068204
2   -0.221797
3    1.351809
Name: 0, dtype: float64

In [7]:
type(dataFrame)

pandas.core.frame.DataFrame

In [8]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"], columns = ["Maas","Yas","Calisma Saati"])

In [9]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -2.635673 -1.345650       0.870424
Zeynep -0.068204 -0.936820       1.385364
Atlas  -0.221797  1.373469       0.015757
Mehmet  1.351809  0.376307      -1.723689

In [10]:
yeniDataFrame["Yas"]

Atil     -1.345650
Zeynep   -0.936820
Atlas     1.373469
Mehmet    0.376307
Name: Yas, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -2.635673 -1.345650
Zeynep -0.068204 -0.936820
Atlas  -0.221797  1.373469
Mehmet  1.351809  0.376307

In [12]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -2.635673 -1.345650       0.870424
Zeynep -0.068204 -0.936820       1.385364
Atlas  -0.221797  1.373469       0.015757
Mehmet  1.351809  0.376307      -1.723689

In [13]:
yeniDataFrame.loc["Atil"]

Maas            -2.635673
Yas             -1.345650
Calisma Saati    0.870424
Name: Atil, dtype: float64

In [14]:
yeniDataFrame.loc["Zeynep"]

Maas            -0.068204
Yas             -0.936820
Calisma Saati    1.385364
Name: Zeynep, dtype: float64

In [15]:
yeniDataFrame.iloc[1]

Maas            -0.068204
Yas             -0.936820
Calisma Saati    1.385364
Name: Zeynep, dtype: float64

In [16]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -2.635673 -1.345650       0.870424
Zeynep -0.068204 -0.936820       1.385364
Atlas  -0.221797  1.373469       0.015757
Mehmet  1.351809  0.376307      -1.723689

In [17]:
yeniDataFrame["Maas"]

Atil     -2.635673
Zeynep   -0.068204
Atlas    -0.221797
Mehmet    1.351809
Name: Maas, dtype: float64

In [18]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [19]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -2.635673 -1.345650       0.870424       -2.691301
Zeynep -0.068204 -0.936820       1.385364       -1.873640
Atlas  -0.221797  1.373469       0.015757        2.746939
Mehmet  1.351809  0.376307      -1.723689        0.752613

In [20]:
yeniDataFrame.drop("Yas", axis = 1) ## axis = 1 sütun demek

            Maas  Calisma Saati  Emeklilik Yasi
Atil   -2.635673       0.870424       -2.691301
Zeynep -0.068204       1.385364       -1.873640
Atlas  -0.221797       0.015757        2.746939
Mehmet  1.351809      -1.723689        0.752613

In [21]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -2.635673 -1.345650       0.870424       -2.691301
Zeynep -0.068204 -0.936820       1.385364       -1.873640
Atlas  -0.221797  1.373469       0.015757        2.746939
Mehmet  1.351809  0.376307      -1.723689        0.752613

In [22]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -2.635673 -1.345650       0.870424       -2.691301
Zeynep -0.068204 -0.936820       1.385364       -1.873640
Atlas  -0.221797  1.373469       0.015757        2.746939

In [23]:
yeniDataFrame.drop("Calisma Saati",axis = 1,inplace = True)

In [24]:
yeniDataFrame

            Maas       Yas  Emeklilik Yasi
Atil   -2.635673 -1.345650       -2.691301
Zeynep -0.068204 -0.936820       -1.873640
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [25]:
yeniDataFrame.loc["Atil"]["Yas"]

-1.3456503187223043

In [26]:
yeniDataFrame.loc["Atlas","Yas"]

1.3734694562835357

In [27]:
yeniDataFrame

            Maas       Yas  Emeklilik Yasi
Atil   -2.635673 -1.345650       -2.691301
Zeynep -0.068204 -0.936820       -1.873640
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [28]:
yeniDataFrame < 0

         Maas    Yas  Emeklilik Yasi
Atil     True   True            True
Zeynep   True   True            True
Atlas    True  False           False
Mehmet  False  False           False

In [29]:
booleanFrame = yeniDataFrame < 0

In [30]:
yeniDataFrame[booleanFrame]

            Maas      Yas  Emeklilik Yasi
Atil   -2.635673 -1.34565       -2.691301
Zeynep -0.068204 -0.93682       -1.873640
Atlas  -0.221797      NaN             NaN
Mehmet       NaN      NaN             NaN

In [31]:
yeniDataFrame[yeniDataFrame<0]

            Maas      Yas  Emeklilik Yasi
Atil   -2.635673 -1.34565       -2.691301
Zeynep -0.068204 -0.93682       -1.873640
Atlas  -0.221797      NaN             NaN
Mehmet       NaN      NaN             NaN

In [32]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Emeklilik Yasi
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [33]:
yeniDataFrame

            Maas       Yas  Emeklilik Yasi
Atil   -2.635673 -1.345650       -2.691301
Zeynep -0.068204 -0.936820       -1.873640
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [34]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Emeklilik Yasi
0    Atil -2.635673 -1.345650       -2.691301
1  Zeynep -0.068204 -0.936820       -1.873640
2   Atlas -0.221797  1.373469        2.746939
3  Mehmet  1.351809  0.376307        0.752613

In [35]:
yeniDataFrame

            Maas       Yas  Emeklilik Yasi
Atil   -2.635673 -1.345650       -2.691301
Zeynep -0.068204 -0.936820       -1.873640
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [36]:
yeniDataFrame.reset_index(inplace = True)

In [37]:
yeniDataFrame

    index      Maas       Yas  Emeklilik Yasi
0    Atil -2.635673 -1.345650       -2.691301
1  Zeynep -0.068204 -0.936820       -1.873640
2   Atlas -0.221797  1.373469        2.746939
3  Mehmet  1.351809  0.376307        0.752613

In [38]:
yeniIndexListesi = ["Ati","Zey","Atl","Meh"]

In [39]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [40]:
yeniDataFrame

    index      Maas       Yas  Emeklilik Yasi Yeni Index
0    Atil -2.635673 -1.345650       -2.691301        Ati
1  Zeynep -0.068204 -0.936820       -1.873640        Zey
2   Atlas -0.221797  1.373469        2.746939        Atl
3  Mehmet  1.351809  0.376307        0.752613        Meh

In [41]:
yeniDataFrame.set_index("Yeni Index")

             index      Maas       Yas  Emeklilik Yasi
Yeni Index
Ati           Atil -2.635673 -1.345650       -2.691301
Zey         Zeynep -0.068204 -0.936820       -1.873640
Atl          Atlas -0.221797  1.373469        2.746939
Meh         Mehmet  1.351809  0.376307        0.752613

In [42]:
yeniDataFrame.set_index("Yeni Index",inplace = True)

In [43]:
yeniDataFrame

             index      Maas       Yas  Emeklilik Yasi
Yeni Index
Ati           Atil -2.635673 -1.345650       -2.691301
Zey         Zeynep -0.068204 -0.936820       -1.873640
Atl          Atlas -0.221797  1.373469        2.746939
Meh         Mehmet  1.351809  0.376307        0.752613

In [88]:
yeniDataFrame.set_index("index",inplace = True)

In [90]:
yeniDataFrame

            Maas       Yas  Emeklilik Yasi
index
Atil   -2.635673 -1.345650       -2.691301
Zeynep -0.068204 -0.936820       -1.873640
Atlas  -0.221797  1.373469        2.746939
Mehmet  1.351809  0.376307        0.752613

In [92]:
yeniDataFrame.reset_index(inplace = True)

In [94]:
yeniDataFrame

    index      Maas       Yas  Emeklilik Yasi
0    Atil -2.635673 -1.345650       -2.691301
1  Zeynep -0.068204 -0.936820       -1.873640
2   Atlas -0.221797  1.373469        2.746939
3  Mehmet  1.351809  0.376307        0.752613

In [96]:
ilkIndex = ["Simpson","Simpson","SouthPark","SouthPark"]

In [98]:
icIndex = ["Homer","Bart","Cartman","Kenny"]

In [100]:
birlesmisIndex = list(zip(ilkIndex,icIndex))

In [102]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('SouthPark', 'Cartman'),
 ('SouthPark', 'Kenny')]

In [104]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [106]:
birlesmisIndex

MultiIndex([(  'Simpson',   'Homer'),
            (  'Simpson',    'Bart'),
            ('SouthPark', 'Cartman'),
            ('SouthPark',   'Kenny')],
           )

In [110]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[20,"C"],[30,"D"]]

In [112]:
cizgiFilmNumpDizisi = np.array(benimCizgiFilmListem)

In [114]:
cizgiFilmNumpDizisi

array([['40', 'A'],
       ['10', 'B'],
       ['20', 'C'],
       ['30', 'D']], dtype='<U21')

In [120]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpDizisi, index = birlesmisIndex, columns = ["Yas","Meslek"])

In [122]:
cizgiFilmDataFrame

                  Yas Meslek
Simpson   Homer    40      A
          Bart     10      B
SouthPark Cartman  20      C
          Kenny    30      D

In [124]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B

In [126]:
cizgiFilmDataFrame.loc["SouthPark"].loc["Kenny"]

Yas       30
Meslek     D
Name: Kenny, dtype: object

In [130]:
cizgiFilmDataFrame.index.names = ["Film Adı","Isim"]

In [132]:
cizgiFilmDataFrame

                  Yas Meslek
Film Adı  Isim
Simpson   Homer    40      A
          Bart     10      B
SouthPark Cartman  20      C
          Kenny    30      D